Memoria-Documentacion-del-proyecto/Como-funcionan-los-pedidos.md
```mermaid
  flowchart TD
    A[Nuevo Pedido] --> B{¿Cliente Registrado?}
    B -- Sí --> E[Generar Pedido]
    B -- No --> D[Registrar Cliente]
    D -- Registro del cliente cancelado --> B
    D -- Cliente registrado --> E

    E --> F[Estado del Pedido: 'Pendiente']
    F --> G{¿Ejecutar pedido?} -- Esperamos la siguiente accion --> G
    G -- Sí --> R[Preparar Pedido]
    G -- No --> I[Cancelar Pedido]
    I --> J[Estado del Pedido: 'Cancelado'] --> N
    R --> H[Estado del Pedido: 'En curso']
    H --> K[Empacar Productos]
    K --> L[Enviar Pedido]
    L --> M[Estado del Pedido: Completado]
    M --> N[Fin del Pedido]

    style A fill:#bb21b6,stroke:#333,stroke-width:2px, color:#FFF, ,rx:500, ry:500
    style J fill:#947c1f,stroke:#333,stroke-width:2px, color:#FFF, ,rx:20, ry:20
    style F fill:#947c1f,stroke:#333,stroke-width:2px, color:#FFF, ,rx:20, ry:20
    style H fill:#947c1f,stroke:#333,stroke-width:2px, color:#FFF, ,rx:20, ry:20
    style M fill:#947c1f,stroke:#333,stroke-width:2px, color:#FFF, ,rx:20, ry:20
    style N fill:#bb21b6,stroke:#333,stroke-width:2px, color:#FFF, ,rx:500, ry:500
```
